title: Windows Brute Force Detection
status: experimental
description: Detects failed Windows logon attempts using Security Event ID 4625 that may indicate a brute force attack 
author: Prishitha Reddy Lokareddy
date: 2026-07-05

references:
  - https://attack.mitre.org/techniques/T1110/

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4625
  condition: selection

falsepositives:
  - User entering an incorrect password
  - Recently changed password
  - Expired credentials
  - Scheduled tasks using outdated credentials

level: medium

tags:
  - attack.credential_access
  - attack.T1110
