title: Windows Reconnaissance Detection
status: experimental
description: Detects reconnaissance activities performed using native Windows commands through Sysmon Event ID 1.
author: Prishitha Reddy Lokareddy
date: 2026-07-05

references:
  - https://attack.mitre.org/techniques/T1033/
  - https://attack.mitre.org/techniques/T1082/
  - https://attack.mitre.org/techniques/T1016/
  - https://attack.mitre.org/techniques/T1087/
  - https://attack.mitre.org/techniques/T1069/001/

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    EventID: 1
  condition: selection

falsepositives:
  - System administrators performing routine maintenance.
  - IT support troubleshooting a system.
  - Security analysts conducting investigations.
  - Automated administrative scripts.
  - Legitimate users checking system information.

level: medium

tags:
  - attack.discovery
  - attack.T1033
  - attack.T1082
  - attack.T1016
  - attack.T1087
  - attack.T1069.001
